[
  {
    "source": "nasa_1.pdf",
    "page": 1,
    "text": "INTRODUCTION TO SATELLITE COMMUNICATIONS \nTECHNOLOGY FOR NREN \nTHOM STONE, CSC, APRIL 2004 \n1. INTRODUCTION \nNREN requirements for development of seamless nomadic networks necessitates that \nNREN staff have a working knowledge of basic satellite technology. This paper \napplications, technology trends, orbits, and spectrum, and hopefully will afford the reader \nan end-to-end picture of this important technology. \nSatellites are objects in orbits about the Earth. An orbit is a trajectory able to maintain \ngravitational equilibrium to circle the Earth without power assist. Physical laws that were \ncomeptualized by Newton and Kepler govern orbital mechanics. \nThe first satellite was the Moon, of course, but the idea of communications satellites \ncame from Sir Arthur C. Clark in 1945. The Soviets launched the first manmade satellite, \nSputnik I, in 1957. The first communications satellite (a simple reflector) was the US. \nEcho I in 1960. The first “geosynchronous” (explained later) satellite, Syncom, went up \nin 1962. There are now over 5000 operational satellites in orbit, 232 of which are large \ncommercial (mostly communications) satellites. \nSatellites have become essential for modern life. Among the important applications of \nsatellite technology are video, voice, IP data, radio, Earth and space observation, global \nresource monitoring, military, positioning (GPS), micro-gravity science and many others. \nFrom direct-to-home TV to the Hubble telescope, satellites are one of the defining \ntechnologies of the modem age. Video is the most successful commercial application for \nsatellites, and direct-to-home distribution is the most promising application for the \ntechnology at this time. “Spot” images of places on Earth, GPS, and Internet \naccess-both for providers and direct-to-home or oficehave been most successful, \nwhile cell phone systems based on fleets of low flying satellites have been a flop. Mobile \nphone-like connections for marine and mobile services have been with us for some time, \nhowever. \nSatellite services have some big advantages, such as being available almost everywhere \non Earth without wires, being mobile, being the perfect broadcast medium, and being \nprotocol agnostic. The downside to satellite technology is that satellites have either a \nlimited visibility over a spot on Earth, or a long round-trip time, and they broadcast data \nthat can be received by anyone under them. Satellite transmissions are also affected by \nboth terrestrial and space weather. They are subject to a higher error rate than fiber, and \nthey are complex from both a physical and regulatory point of view. \nSatellites are launched from Earth by the shuttle, from high-flying airplanes, or from \nground-based rockets. Once launched, payloads must reach proper elevation and escape \nvelocity to be boosted into orbit. In order to maintain proper orbit, satellites are \niAAtoccnc th- cnmnnnento venii;~aA fnr 9 cmtall;to-hicoA rnmmzrn;,-mt;nnc cxrctom \nUU~”““”” ..LA” w”Luy”-”l*ru ‘”‘IU” vu LVI Y “YbYIIL.” “IUIU “V.A.A*I-*I“..c*VILy “J UCVL..,"
  },
  {
    "source": "nasa_1.pdf",
    "page": 2,
    "text": "Introduction to Satellite Communication Technology for NREN \ncontrolled from a ground station on Earth that sends commands and receives status and \ntelemetry from the satellite. \n2. ORBITS \nSatellites are classified by the distance of their orbits above the Earth. Low Earth \nOrbiting (LEO) satellites are located at an altitude of from 100 to 1200 miles, and \nMedium Eartl Orbits (lVEO) are located at m althtde of from 4,000-!2,000 riles. Geo- \nstationary orbits are located exactly 23.4 miles high. There are two Van Allen radiation \nbelts around the Earth. These areas of intense radiation are to be avoided in deploying \nsatellites. The two zones separate LEO and ME0 orbits. \nLEG and ivE0 (sub-geosynchronous j orbiring sareiiires are visitxe for oniy a period of \ntime from the point of view of an observer on Earth. Satellites in these orbits can \ncommunicate with the Earth by “pass of€” to a fleet of like satellites providing full Earth \ncoverage. They can also pass off to a geosynchronous relay satellite, or they can dump \ndata to the ground as they pass over a ground station. Most of these “near Earth” satellites \nare in orbits that go over or near the poles; some go over the same place on Earth at least \nseveral times a day. The coordination and placement of Earth stations to “operate” and \ntake data from these satellites is a major consideration in the life cycle of a satellite. The \nadvantage of sub-geo satellites over those in geosynchronous orbit is that lower orbits are \nless expensive to launch, it takes less power to send and receive data, and the round trip \ntime from Earth is faster. \n. .. . \n0 \nTHE0 (Twelve Hour Eccentric Orbits, or Molniya orbits) are not quite polar orbits that \nstay in a hemisphere for half of a day. This approach allows for two ME0 satellites to \ncover an area of the Earth, thus giving continuous service as a geosynchonous satellite \nwould. This was developed and used extensively in Russia. \nGeosynchronous orbits are the most desirable and the most expensive to obtain. \n“Geosynch” satellites appear stationary to observers on the Earth. The orbit is always at \nthe equator at a height of 23,400 miles; the satellite thus travels in the same direction and \nI"
  },
  {
    "source": "nasa_1.pdf",
    "page": 3,
    "text": "Introduction to Satellite Communication Technology for NREN \nspeed as the rotation of the Earth. These satellites, because they provide continuous \ncoverage, are the workhorses of the commercial satellite industry. Geosynch satellites \nmust be spaced at least 1/2 a degree apart to prevent signal interference. “Slots” are \nclosely regulated by the International Telecommunications Union (T.C.U.). They are \nhighly sought after and expensive to acquire, and since geosynch orbits are also \nexpensive to launch and maintain, most satellites in this orbit are big and complex. \nGeosynchronous orbits require at least a quarter second round-trip time because of the \n23,400-mile distance above the Earth plus the distance to the equator from the ground \nstation. More power is also needed because of the distance (although a larger antenna on \nsome satellites mitigates some of this). Since geosynch satellites are always in \napproximately the same place with regard to the Earth, it is possible to precisely map a \n“footprint” so that users can calibrate ground station equipment to minimize power and \nbandwidth. \nGeosynch satellites are kept tightly in their orbits by expending fuel. Older satellites are \noften let to drift north and south while keeping in their east-west slots. Satellites allowed \nto dnfi are said to be inclined orbits. This might require some tracking by ground \nequipment, but when the drift is large enough, it allows the satellites to be seen in the \npolar regions. \n3. SPECTRUM \nSatellites use the microwave band for communications (some older ones used the radio \nffequencies UHF, VHF). For a description of the electromagnetic spectrum check \nh ttp://imagine.gsfc. nasa.gov/docs/scienceAnow - I I/emspectrum. htm 1. \nI \n~ ~~~~~~ ~~~ \nWe modify sound waves to make speech. Dynamics such as loudness and tone are \nchanged to convey meaning. Telecommunication modifies electromechanical signals \nsuch as microwaves to carry information in the same ways. \nMicrowave bandwidth is regulated by the FCC in the U.S. and by the ITU internationally. \nObtaining parts of the regulated bandwidth is expensive. Satellite operators must apply"
  },
  {
    "source": "nasa_1.pdf",
    "page": 4,
    "text": "Introduction to Satellite Communication Technology for NREN \nyears in advance to get spectrum for launch support, tracking, telemetery and operations, \nand for data transfer. \nParts of the microwave spectrum are designated and used as follows (for a detailed \ndescription see: http://www.NTIA.doc.gov/osmhome/nebbie.html): \nVHFA-JHF 0.1-0.3 GHz - Milsat- amateur radio, “little” LEO \nL Band - 1-2 GHz - Mobile Sat/manne, “big” LEO \nS Band 2-4 GHz - Satellite commandcontrol \nC Band 4-8 GHz - Data, voice, video distribution \nKu 12-18 GHz - Direct TV, Data, Voice, SNG, IP services \nK 18-27 GHz -N/A (22.3-HzO absorption) \nKa 27-40 GHz - The next wave \n* V 40-75 GHz - Released in the future (60 GHz -02 absorption) \nZ& v n--A o 1 OTT- n s:i:~-- PACI \nA YOllU O-IL UIiL - lvLlllLilly-cwa \nUplink (from the Earth to the satellite) uses the upper part of a kequency range while \ndownlink uses the lower fi-equencies. This is because a satellite is less capable of dealing \nwith the overtones derived from transmission. \nThe higher the fi-equency the more bandwidth it takes to send a bit. That is because there \nthat are absorbed by water and free Oxygen. Also, the higher the frequency the smaller is \nthe antenna needed for the same bandwidth, as antenna size is related to the size of the \nwaveforms. The exception to this is L-Band where the signal is omni-directional. K- \nBand is not used for satellite transmission as these frequencies are absorbed completely \nby water vapor. Traditional C-Band, the first spectrum opened to satellites for \ncommunications, requires a BUD (big ugly dish) at least 3 meters in diameter for even a \nsmall bandwidth V-Sat, and up to 20 meters for a proper Earth station. Ku and Ka use \nsmall dishes that can be portable. \n4. EARTH STATIONS \nTeleports, gateways, and “flyaways” are names for the terrestrial interface where the \nsignal from satellites meets the ground and where data is uplinked to the satellite. The \ntraditional architecture for satellite systems is to have a central complex with an antenna \nor antennas controlling transmission to and &om satellites. Smaller antennas \ncommunicate to other ground stations or terrestrial networks via. the central teleport. \nTeleports act as a gateway between terrestrial networks such as the PSTN, the Internet or \ncable TV infrastructure, 2nd the srtellite. \nis gicztei atterriattioii of the sipa! “vj: the amospheie ii~ i;v‘e get c!osei to &e frequei~ci~~ \n4"
  },
  {
    "source": "nasa_1.pdf",
    "page": 5,
    "text": "Introduction to Satellite Communication Technology for NREN \nAside from the interface equipment to connect to ground networks, the Earth station will \nhave an assortment of hardware to receive and send the microwave signals to and from \nthe satellite: \nReflector \nLow Noise Amplifier \n(for Receive) \nSolid State Power \nAmplifier (for Send) \n1 I Up/Down Converter \nDemodulate \n1-1 Modulate Satellite Modem \nt \nDigita P Signal \n1. A reflector and feed: This is the ''dish\" that is the most visible component of the \nsystem. The dish focuses the signal on the feed which sends it on. The size and shape \nof the dish are a function of the frequencies used and the strength of the signal. The \nlarger the dish, the smaller the area of the sky it can see. This seems counter-intuitive \nbut it is true. \n2. Outdoor equipment: This equipment isolates the signals to those we are interested in \nand amplifies the signals (both send and receive). The equipment to change the \nffequency range to those the satellite expects (up and down converters) from L-Band \ncan be either indoor or outdoor. \n3. Cable: Cable connects the antenna to the inside equipment. \n4. A satellite modem that operates in L-Band (this could be separate modulators and \ndemodulators): These modems do more than the common terrestrial versions in doing"
  },
  {
    "source": "nasa_1.pdf",
    "page": 6,
    "text": "1 \nIntroduction to Satellite Communication Technology for NREN \nA/D and D/A conversion. They also define the signal method, do error correction \nusing redundancy coding, do time and frequency multiplexing, and perform link \nmonitoring. Satellite links are often asymmetric, having the ability to receive more \ndzta than they can send. \n5. Tracking gears: Gears move the antenna, if needed. \n6. A mtc~owove ~cnsporcnt bt;i!dirzg (radome): A radome is required if the reflectm, \nfeed and outdoor equipment requires covering from wind and snow. \n7. The terrestrial interconnect: This could be a router, or a video codex or a multiplexer \nto combine several input streams. \nIn order for an Earth station to become operational it must go through a series of tests and \nadjustments. The tests are designed to test whether proper frequencies and time slots (for \nTDM access) are used. Measurements are made and documented to insure that the power \nlevels are correct. The power is measured in terms of Effective Isotropic Radiated Power \n(EIRE’). The units are decibels (dBW). Too much power can cause the signal to be \ndistorted and could disrupt other communications. Under-powered transmission can be \nerror prone. \nThe noise level in both directions is measured. This is G/T (the ratio of the gain fi-om the \nantenna and outdoor equipment to the signal noise). The higher the ratio the better. The \ndefinitive test is of course the actual error statistics measured by sending test data in both \ndb3CtiOES. \n5. COMMUNICATIONS ONBOARD A SATELLITE \nEarth orbiting satellites are a wonder of modern technology. Everything must withstand \nthe rigors of space in addition to the strain of the launch. In space there are extreme cold \nand heat, radiation and micrometeorites, and storms on the Sun. Orbits must be obtained \nand maintained and critical systems must be monitored. There are as many “floor plans” \nto satellites as there are applications for the technology. \n6"
  },
  {
    "source": "nasa_1.pdf",
    "page": 7,
    "text": "Introduction to Satellite Communication Technology for NREN \nThe main systems on a satellite are power, propulsion, guidance, sometimes science \ninstruments, and of course communications and tracking. \nThe minimum communications capability for any satellite, no matter its purpose, is a \nlow-speed link capable of send and receive for commanding, tracking and telemetry. \n6. COMMUNICATIONS SATELLITES \nCommunications satellites divide bandwidth between “transponders.” A transponder is \nthe hardware needed to take signals in on one set of frequencies and re-send to the ground \non other frequencies (like a bent Dipe). Usually a transponder is caDable of sending I and \nreceiving about 45 Mb/sec. These are analog signal processors, so-the modulation \ntechnique will determine the bandwidth a user can actually expect. \n1. C-band transponders are usually 36 MHz wide \n2. Ku-band transponders are usually 54 MHz wide \n3. Ka-band transponders are usually 100 MHz wide \nThe total capacity of a “Comsat” is between 1/2 and 2 Gb/sec, much less than a pair of \nfiber strands. Frequency reuse is obtained by use of beams. They separate the direction \nof the transmissions and reception by pointing the antenna at the ground in different \ndirections. Thus a satellite can send the same frequencies on a beam to Chicago and also \non a beam to New York Additional bandwidth is obtained by use of polarization that \ndoubles usable bandwidth. \nSolar weather can very adversely affect communications satellites, sometimes to the \nextent that a flare will actually render a communications satellite inoperable. \nGeosynchronous communications satellites have a predictable power signature for areas \ncovered by their transponders. This footprint makes it possible to know the required dish \nsize and power requirements before an Earth station is assembled at a site. Errors can be \nminimized and higher bandwidth obtained by using a bigger dish, more power, or better \ncoding. \n7. DWCTIONS IN THE SATELLITE INDUSTRY \nThe great down-turn that has hit the technology and communications industry in general \nhas not spared the satellite industry. Some nations, such as Japan, have drastically cut \nback their space research and development. Even the International Space Station may \nnever reach its low goals. Both commercial and government (except military) launch \nschedules have been cut back making it unlikely that all of the players who build and \nlaunch satellites will last the next few years. \nEven amid this “consolidation, competition, retrenchment and turbulence” there are \npositive trends that will survive this turndown and thrive in the early 21’‘ century. Some \nof the trends include the following: \n1. Spurred by the military, there will be more big “birds” with more bandwidth and new \nspectrum. \n7"
  },
  {
    "source": "nasa_1.pdf",
    "page": 8,
    "text": "Introduction to Satellite Communication Technology for NREN \n2. \n3. \n4. \n5. \n6. \n7. \nNew coding technologies now perfected will double bandwidth of even existing \nsatellites. Launch costs will decline substantially. \nThe new paradigm is universal, bi-directional access, including television, Internet \nand new media over the next-generation satellite systems. \nThere will be more IP in space. Multicast will become accepted after adoption on \nsatellite-based ISP backbcjiies. \nIP services will be integrated with TV broadcast, first using DVB-S (digital video \nbroadcasting-satellite) technology and then straight IP. \nNovel applications __ (like the roll out of satellite car radio) will be developed. \nEarth science applications will require more spectrum and direct access for users \ninternationally. “On demand” will be the next wave. As global warming and other \nenvironmental issues come to the forefront, Earth Observing satellites will become \nmore prominent. \nSatellites have been with us nearly half a century and have evolved considerably. The \nnext 50 years will bring more technological changes that will affect our lifestyles. \n8"
  }
]